44: Menata ulang penempatan kolom pada Data Frame

2273009 -  Bryan Nicholas

Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.1.3
1.26.2

Persiapan Data Frame

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  1  8  8  8  2
1  1  8  4  3  2
2  8  8  8  4  8
3  6  7  7  2  9
4  8  6  1  8  2

Menata ulang penempatan kolom pada Data Frame

In [3]:
df[['D', 'C', 'A', 'E', 'B']]

   D  C  A  E  B
0  8  8  1  2  8
1  3  4  1  2  8
2  4  8  8  8  8
3  2  7  6  9  7
4  8  1  8  2  6

In [4]:
df

   A  B  C  D  E
0  1  8  8  8  2
1  1  8  4  3  2
2  8  8  8  4  8
3  6  7  7  2  9
4  8  6  1  8  2

In [5]:
df = df[['D', 'C', 'A', 'E', 'B']]
df

   D  C  A  E  B
0  8  8  1  2  8
1  3  4  1  2  8
2  4  8  8  8  8
3  2  7  6  9  7
4  8  1  8  2  6